Revit 2027 API
RoutingPreferenceRule Methods
The RoutingPreferenceRule type exposes the following members.
Methods
Name | Description
AddCriterion |  Adds a new routing criterion.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCriterion |  Gets the specified criteria.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
RemoveCriteron |  Removes an existing criterion.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace